### Working with pandas dataframes

[Official Documentation](https://pandas.pydata.org/docs/)

[Course page](https://ds.codeup.com/python/dataframes/)

<div class="alert alert-block alert-info">

#### Learning Goals
    
- Understand the structure of a dataframe
- View information about the contents of a dataframe
- Determine attributes of the data within the dataframe
- Manipulate columns
- Sort and filter contents of dataframe
- Create, modify, and drop columns
- View descriptive statistics for data

### Sources of dataframes

- Created from dictionaries, lists, or arrays
- Imported from Python libraries (e.g. `pydataset`)
- Read from `csv`, `tsv`, `xlsx` files
- SQL databases

---

### Import statements

In [1]:
# Imported libraries
import pandas as pd

# Numpy to build arrays
import numpy as np

# Source of datasets
from pydataset import data

# Set a value to initialize the random integer generation
np.random.seed(123)

initiated datasets repo at: /Users/donq/.pydataset/

---

## Creating a dataframe

- Combine multiple series of equal length.

In [2]:
# Create a list of students
students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas', 'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

In [3]:

# Randomly generate 12 scores for each subject (1 per student)
# Store values as arrays
# Note that all the values need to have the same length here

math_grades = np.random.randint(low=60, high=100, size=len(students))

english_grades = np.random.randint(low=60, high=100, size=len(students))

reading_grades = np.random.randint(low=60, high=100, size=len(students))

In [4]:
# Create a dictionary with structure:
# 'column_name': <array or list>

df_dict = {'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades}

In [5]:

# Use pd.DataFrame
df = pd.DataFrame(df_dict)

# View the type
type(df)

pandas.core.frame.DataFrame

### Check data types

In [6]:
type(students)

list

In [7]:
type(reading_grades)

numpy.ndarray

In [8]:
type(df_dict)

dict

### Display a table for the dataframe

In [10]:
df

       name  math  english  reading
0     Sally    62       85       80
1      Jane    88       79       67
2     Suzie    94       74       95
3     Billy    98       96       88
4       Ada    77       92       98
5      John    79       76       93
6    Thomas    82       64       81
7     Marie    93       63       90
8    Albert    92       62       87
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

In [11]:
display(df)  # same as just typing the name of the DataFrame

       name  math  english  reading
0     Sally    62       85       80
1      Jane    88       79       67
2     Suzie    94       74       95
3     Billy    98       96       88
4       Ada    77       92       98
5      John    79       76       93
6    Thomas    82       64       81
7     Marie    93       63       90
8    Albert    92       62       87
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

### Dimension of dataframe

Format: A tuple with (rows, columns)

In [12]:
df.shape # row, column

(12, 4)

### View portions of the dataframe

```python
.head(n) # first n rows (default = 5 rows)
.tail(n) # last n rows (default = 5 rows)
.sample(n) # randomly select n rows (default = 1 row)
```

In [13]:
df.head()

    name  math  english  reading
0  Sally    62       85       80
1   Jane    88       79       67
2  Suzie    94       74       95
3  Billy    98       96       88
4    Ada    77       92       98

In [14]:
df.tail(3)

       name  math  english  reading
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

In [20]:
df.sample(3)

    name  math  english  reading
5   John    79       76       93
0  Sally    62       85       80
2  Suzie    94       74       95

### Information about the dataframe's contents

| Name | Description |
| ---:|:------ |
|`#`  | The row index|
|`Column`| Index/name of column (a string) |
|`Non-Null Count` | Number of non-empty values 
|`Dtype` |    The data type |

In [26]:
df.info() # note this is a method! great way to get a summary look at the data and where
# are nulls

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     12 non-null     object
 1   math     12 non-null     int64
 2   english  12 non-null     int64
 3   reading  12 non-null     int64
dtypes: int64(3), object(1)
memory usage: 512.0+ bytes

### Data types

In [22]:
df.dtypes

name       object
math        int64
english     int64
reading     int64
dtype: object

In [24]:
df.describe().round(2) # descriptive stats on df

        math  english  reading
count  12.00    12.00    12.00
mean   84.83    77.67    86.50
std    11.13    13.37     9.64
min    62.00    62.00    67.00
25%    78.50    63.75    80.75
50%    90.00    77.50    89.00
75%    92.25    86.75    93.25
max    98.00    99.00    98.00

### Descriptive Statistics

---

## Working with Columns

- View column information
- Rename columns
- Drop columns

### View Column Information

### Check data types

In [70]:
type(columns)

NameError: name 'columns' is not defined

<div class="alert alert-block alert-info">
    
### Important Notes
    
- Keep in mind what data structure you are working with
- Recall that methods do not alter the original data structure
- Check documentation for what the parameters and results of a pandas function are

### Dropping columns

- Drop all columns except for the student's name and math grade
- Assign the results to a new dataframe

In [29]:
df.columns

Index(['name', 'math', 'english', 'reading'], dtype='object')

In [30]:
df.drop(columns = ['english', 'reading']) 
# note this is a method and df is not changed

       name  math
0     Sally    62
1      Jane    88
2     Suzie    94
3     Billy    98
4       Ada    77
5      John    79
6    Thomas    82
7     Marie    93
8    Albert    92
9   Richard    69
10    Isaac    92
11     Alan    92


### Tip

- Create a list with the columns you want to drop

In [31]:
dropped_columns = ['english', 'reading']

In [32]:
df.drop(columns = dropped_columns)

       name  math
0     Sally    62
1      Jane    88
2     Suzie    94
3     Billy    98
4       Ada    77
5      John    79
6    Thomas    82
7     Marie    93
8    Albert    92
9   Richard    69
10    Isaac    92
11     Alan    92

### Renaming columns

- Rename the columne `name` to `student`
- Use a dictionary structure
- Assign to a new dataframe

```python
{'old_name': 'new_name'}
```

In [33]:
df.columns

Index(['name', 'math', 'english', 'reading'], dtype='object')

In [34]:
df.rename(columns = {'name':'student'})

    student  math  english  reading
0     Sally    62       85       80
1      Jane    88       79       67
2     Suzie    94       74       95
3     Billy    98       96       88
4       Ada    77       92       98
5      John    79       76       93
6    Thomas    82       64       81
7     Marie    93       63       90
8    Albert    92       62       87
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

### Selecting a column

In [35]:
math_performance = df['math']

In [36]:
type(math_performance)  # note a df column is a Series

pandas.core.series.Series

In [39]:
math_reading_performance = df[['math', 'reading']] # 2 cols is a df

In [40]:
type(math_reading_performance)

pandas.core.frame.DataFrame

In [41]:
math_values = df.math # can call a column as an attribue with dot notation

In [43]:
type(math_values)

pandas.core.series.Series

### Creating new columns


- Use a comparison operator on a column to return Boolean values 
- Create a new column with these contents
- Use assign to set the column values equal to the Boolean values

In [45]:
#column bracket notation
df['passing_math'] = df.math >= 70

In [47]:
df

       name  math  english  reading  passing_math
0     Sally    62       85       80         False
1      Jane    88       79       67          True
2     Suzie    94       74       95          True
3     Billy    98       96       88          True
4       Ada    77       92       98          True
5      John    79       76       93          True
6    Thomas    82       64       81          True
7     Marie    93       63       90          True
8    Albert    92       62       87          True
9   Richard    69       80       94         False
10    Isaac    92       99       93          True
11     Alan    92       62       72          True

In [48]:
df_high_score_math = df[df.math >= 90]

In [49]:
df_high_score_math 
# here we created a new DataFrame from the old one

      name  math  english  reading  passing_math
2    Suzie    94       74       95          True
3    Billy    98       96       88          True
7    Marie    93       63       90          True
8   Albert    92       62       87          True
10   Isaac    92       99       93          True
11    Alan    92       62       72          True

---

### Sorting dataframes

- Use `.sort_values`
- set which column to sort by
- Set ascending or descending

In [50]:
df.sort_values(by = 'english', ascending = False)
# to sort students in descending order of english grades
# ascending is default, that is opt. argument

       name  math  english  reading  passing_math
10    Isaac    92       99       93          True
3     Billy    98       96       88          True
4       Ada    77       92       98          True
0     Sally    62       85       80         False
9   Richard    69       80       94         False
1      Jane    88       79       67          True
5      John    79       76       93          True
2     Suzie    94       74       95          True
6    Thomas    82       64       81          True
7     Marie    93       63       90          True
8    Albert    92       62       87          True
11     Alan    92       62       72          True

### Chaining Operations

In [53]:
df[df.english > 90].sort_values(by = 'english').head(1).name
# note that I can return the name out of this statement

4    Ada
Name: name, dtype: object

---

## Importing datasets

```python
import pandas as pd
from pydataset import data
```

In [54]:
data()  # to see available datasets
# important to know about how the dataset was collected
#  is documentation on the mpg dataset

        dataset_id                                             title
0    AirPassengers       Monthly Airline Passenger Numbers 1949-1960
1          BJsales                 Sales Data with Leading Indicator
2              BOD                         Biochemical Oxygen Demand
3     Formaldehyde                     Determination of Formaldehyde
4     HairEyeColor         Hair and Eye Color of Statistics Students
..             ...                                               ...
752        VerbAgg                  Verbal Aggression item responses
753           cake                 Breakage Angle of Chocolate Cakes
754           cbpp                 Contagious bovine pleuropneumonia
755    grouseticks  Data on red grouse ticks from Elston et al. 2001
756     sleepstudy       Reaction times in a sleep deprivation study

[757 rows x 2 columns]

In [55]:
#  is documentation on the mpg dataset
data('mpg', show_doc = True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

### View available datasets

In [58]:
data()

        dataset_id                                             title
0    AirPassengers       Monthly Airline Passenger Numbers 1949-1960
1          BJsales                 Sales Data with Leading Indicator
2              BOD                         Biochemical Oxygen Demand
3     Formaldehyde                     Determination of Formaldehyde
4     HairEyeColor         Hair and Eye Color of Statistics Students
..             ...                                               ...
752        VerbAgg                  Verbal Aggression item responses
753           cake                 Breakage Angle of Chocolate Cakes
754           cbpp                 Contagious bovine pleuropneumonia
755    grouseticks  Data on red grouse ticks from Elston et al. 2001
756     sleepstudy       Reaction times in a sleep deprivation study

[757 rows x 2 columns]

---
<div class="alert alert-block alert-success">
    
### In-class exercise 

- Randomly select one dataset from `pydataset`
- Load the dataset as a dataframe
- View information about the dataset

In [65]:
data('cake')

     replicate recipe  temperature  angle  temp
1            1      A          175     42   175
2            1      A          185     46   185
3            1      A          195     47   195
4            1      A          205     39   205
5            1      A          215     53   215
..         ...    ...          ...    ...   ...
266         15      C          185     28   185
267         15      C          195     25   195
268         15      C          205     25   205
269         15      C          215     31   215
270         15      C          225     25   225

[270 rows x 5 columns]

In [66]:
data('cake', show_doc=True)

cake

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Breakage Angle of Chocolate Cakes

### Description

Data on the breakage angle of chocolate cakes made with three different
recipes and baked at six different temperatures. This is a split-plot design
with the recipes being whole-units and the different temperatures being
applied to sub-units (within replicates). The experimental notes suggest that
the replicate numbering represents temporal ordering.

### Format

A data frame with 270 observations on the following 5 variables.

`replicate`

a factor with levels `1` to `15`

`recipe`

a factor with levels `A`, `B` and `C`

`temperature`

an ordered factor with levels `175` < `185` < `195` < `205` < `215` < `225`

`angle`

a numeric vector giving the angle at which the cake broke.

`temp`

numeric value of the baking temperature (degrees F).

### Details

The `replicate` factor is nested within the `recipe` factor, and `temperature`
is nested within `replicate`.

### Source

Original data were presented in Cook (1938), and reported in Cochran and Cox
(1957, p. 300). Also cited in Lee, Nelder and Pawitan (2006).

### References

Cook, F. E. (1938) _Chocolate cake, I. Optimum baking temperature_. Master's
Thesis, Iowa State College.

Cochran, W. G., and Cox, G. M. (1957) _Experimental designs_, 2nd Ed. New
York, John Wiley \& Sons.

Lee, Y., Nelder, J. A., and Pawitan, Y. (2006) _Generalized linear models with
random effects. Unified analysis via H-likelihood_. Boca Raton, Chapman and
Hall/CRC.

### Examples

    str(cake)
    ## 'temp' is continuous, 'temperature' an ordered factor with 6 levels
    (fm1 <- lmer(angle ~ recipe * temperature + (1|recipe:replicate), cake, REML= FALSE))
    (fm2 <- lmer(angle ~ recipe + temperature + (1|recipe:replicate), cake, REML= FALSE))
    (fm3 <- lmer(angle ~ recipe + temp        + (1|recipe:replicate), cake, REML= FALSE))
    ## and now "choose" :
    anova(fm3, fm2, fm1)


---

### Logical Operators


 `&`    and 
 
 `|`    or
 
 `not`  not

### Find students who are eligible for:

- High-performer award (At leat 80 in Math and English)
- Subject award (at least 90 in a subject)
- Exemplary award (at least 90 in all subjects)

In [67]:
df[ (df['math'] >= 80) & (df['reading'] >= 80) & (df['english'] >= 80)]

     name  math  english  reading  passing_math
3   Billy    98       96       88          True
10  Isaac    92       99       93          True

In [69]:
df[ (df['math'] >= 90) | (df['reading'] >= 90) | (df['english'] >= 90)]

       name  math  english  reading  passing_math
2     Suzie    94       74       95          True
3     Billy    98       96       88          True
4       Ada    77       92       98          True
5      John    79       76       93          True
7     Marie    93       63       90          True
8    Albert    92       62       87          True
9   Richard    69       80       94         False
10    Isaac    92       99       93          True
11     Alan    92       62       72          True

In [ ]:
# can use inplace = True to actually modify underlying df